In [1]:
import pandas as pd
import numpy as np

## Question 1

In [2]:
panda = pd.DataFrame({"age": [13, 17, 9, 2, 4], "height": [18, 29, 7, 4, 13]})
panda

   age  height
0   13      18
1   17      29
2    9       7
3    2       4
4    4      13

### Part a

In [3]:
(panda['height']/panda['age']).mean()

1.823655103066868

### Part b

In [4]:
panda.groupby("age")["height"].median()

age
2      4.0
4     13.0
9      7.0
13    18.0
17    29.0
Name: height, dtype: float64

### Part c

In [5]:
panda['height/age'] = panda['height'] / panda['age']
panda.groupby("age")['height/age'].agg('median')

age
2     2.000000
4     3.250000
9     0.777778
13    1.384615
17    1.705882
Name: height/age, dtype: float64

## Question 2

In [7]:
ath = pd.DataFrame({"ID": [1, 2, 2, 3, 4],
             "Name": ["Edgar Lindenau Aabye", "Minna Maarit Aalto", "Minna Maarit Aalto", "Kjetil Andr Aamodt", "Ragnhild Margrethe Aamodt"],
             "Sex": ["M", "F", "F", "M", "F"],
             "Age": [34.0, 30.0, 34.0, 20.0, 27.0],
             "Height": [np.nan, 159, 159, 176, 163],
             "Weight": [np.nan, 55.5, 55.5, 85, np.nan],
             "Team": ["Denmark/Sweden", "Finland", "Finland", "Norway", "Norway"],
             "Year": [1900, 1996, 2000, 1992, 2008],
             "Season": ['Summer', "Summer", "Summer", "Winter", "Summer"],
             "City": ["Paris", "Atlanta", "Sydney", "Albertville", "Beijing"],
             "Sport": ["Tug-Of-War", "Sailing", "Sailing", "Alpine Skiing", "Handball"],
             "Event": ["Tug-Of-War Men's Tug-Of-War", "Sailing Women's Windsurfer", "Sailing Women's Windsurfer", "Alpine Skiing Men's Super G", "Handball Women's Handball"],
             "Medal": ["Gold", np.nan, np.nan, "Gold", "Gold"]})


ath

,ID,Name,Sex,Age,Height,Weight,Team,Year,Season,City,Sport,Event,Medal
0,1,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
1,2,Minna Maarit Aalto,F,30.0,159.0,55.5,Finland,1996,Summer,Atlanta,Sailing,Sailing Women's Windsurfer,NaN
2,2,Minna Maarit Aalto,F,34.0,159.0,55.5,Finland,2000,Summer,Sydney,Sailing,Sailing Women's Windsurfer,NaN
3,3,Kjetil Andr Aamodt,M,20.0,176.0,85.0,Norway,1992,Winter,Albertville,Alpine Skiing,Alpine Skiing Men's Super G,Gold
4,4,Ragnhild Margrethe Aamodt,F,27.0,163.0,NaN,Norway,2008,Summer,Beijing,Handball,Handball Women's Handball,Gold

### Part a

In [8]:
ath.loc[ath["Medal"] == "Gold", "Name"].str.split().str[1].value_counts().index[:10]

Index(['Lindenau', 'Andr', 'Margrethe'], dtype='object')

### Part b

#### Requires Clarification

In [37]:
ath[["ID", "Medal", "Name"]].groupby("Name").count().sort_values("Medal", ascending = False)["Medal"].iloc[0]

## can't do value_counts() because it'll find the total count of non-null and null medals. 
## .count() just finds the count of non-null

1

### Part c

In [38]:
ath.sort_values('Age', ascending=False)

,ID,Name,Sex,Age,Height,Weight,Team,Year,Season,City,Sport,Event,Medal
0,1,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
2,2,Minna Maarit Aalto,F,34.0,159.0,55.5,Finland,2000,Summer,Sydney,Sailing,Sailing Women's Windsurfer,NaN
1,2,Minna Maarit Aalto,F,30.0,159.0,55.5,Finland,1996,Summer,Atlanta,Sailing,Sailing Women's Windsurfer,NaN
4,4,Ragnhild Margrethe Aamodt,F,27.0,163.0,NaN,Norway,2008,Summer,Beijing,Handball,Handball Women's Handball,Gold
3,3,Kjetil Andr Aamodt,M,20.0,176.0,85.0,Norway,1992,Winter,Albertville,Alpine Skiing,Alpine Skiing Men's Super G,Gold

In [39]:
ath.sort_values('Age', ascending=False).groupby('Sport').agg({'Name':'first', 'Year':'first'})

                                    Name  Year
Sport
Alpine Skiing         Kjetil Andr Aamodt  1992
Handball       Ragnhild Margrethe Aamodt  2008
Sailing               Minna Maarit Aalto  2000
Tug-Of-War          Edgar Lindenau Aabye  1900

### Part d

##### Currently no output, but feel free to play around with the DataFrame to generate output

In [40]:
def filter_func(subframe):
    return (subframe["Year"].diff() >= 10).any()

# note that pd.diff is not required!
# return (subframe[’Year’].iloc[:-1].values + 10 <=
# subframe[’Year’].iloc[1:].values).any()

ath.sort_values("Year")[~ath["Medal"].isna()].groupby("Name").filter(filter_func)["Name"].unique()

/tmp/ipykernel_75/1172532260.py:8: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  ath.sort_values("Year")[~ath["Medal"].isna()].groupby("Name").filter(filter_func)["Name"].unique()

array([], dtype=object)